let nameEl=document.getElementById("name");
let inputName=prompt("Enter your Name");
nameEl.textContent="Hi.. "+inputName.toUpperCase()

let texts=["గణనాథుడు మిమ్మల్ని అన్నివేళలా దీవించాలి. మీరు ఏ పని మొదలుపెట్టినా ఎలాంటి విఘ్నాలు లేకుండా పూర్తయ్యేటట్లు చూడాలని ఆ మహాగణపతిని మనస్ఫూర్తిగా కోరుకుంటూ..",
"విఘ్నేశ్వరుడి ఆశీస్సులు మీకు ఉండి ఎల్లప్పుడూ ఆనందంగా ఉండాలని కోరుకుంటూ.. వినాయక చవితి శుభాకాంక్షలు..!!","వినాయక చవితి సందర్భంగా మీకు మంచి కలగాలని, ఆయురారోగ్యాలతో ఆనందంగా ఉండాలని మనసారా కోరుకుంటున్నాను.",
"ఆ విఘ్నేశ్వరుడు మీకు ఎల్లప్పుడూ విజయాలని ఇవ్వాలని ఆశిస్తూ వినాయక చవితి శుభాకాంక్షలు..!!",
"వినాయక చవితి సందర్భంగా వినాయకుడి ఆశీస్సులు కలిగి ఎప్పుడు ఇలానే ఉండాలని కోరుకుంటున్నాను...!!",
"మీ ఇంట్లో అందరు ఎల్లవేళలా ఆనందంగా ఉండాలని మనస్ఫూర్తిగా వినాయకుడిని ప్రార్థిస్తూ వినాయక చవితి శుభాకాంక్షలు..",
"ఈ వినాయక చవితి రోజున మీ ఇంటికి ఆనందం వచ్చి సంవత్సరం అంతా కూడా అందరూ ఆరోగ్యంగా, ఆనందంగా ఉండాలని ప్రార్థిస్తున్నాను.",
"ఏ ఇబ్బంది లేకుండా ప్రశాంతంగా, ఆనందంగా, ఆరోగ్యంగా మీ కుటుంబం అంతా ఉండాలని కోరుకుంటూ గణేష్ చతుర్థి శుభాకాంక్షలు..",
"ఆ గణనాథుడి ఆశీస్సులు మీకు, మీ కుటుంబానికి ఎల్లవేళలా ఉండాలని ఆశిస్తూ.. మీకివే మా వినాయక చవితి శుభాకాంక్షలు..",
"విజయ గణపతి అనుగ్రహంతో మీకు, మీ కుటుంబానికి సదా సర్వదా అభయ, విజయ, లాభ, శుభాలు చేకూరాలని కోరుకుంటూ వినాయక చవితి శుభాకాంక్షలు..",
"మీకూ, మీ కుటుంబ సభ్యులకు వినాయక చవితి శుభాకాంక్షలు.. ఆ విఘ్నాదిపతి మీకు క్షేమ, స్థైర్య ఆయురారోగ్యాలు సిద్ధించాలని, సుఖసంతోషాలు చేకూర్చాలని మనస్ఫూర్తిగా కోరుకుంటున్నా."
]
let msg=texts[Math.ceil(Math.random()*texts.length)]
if (inputName==undefined){
    inputName=""
}
let sendmsg=msg+'%20%20%20 *మీ%20'+inputName.toUpperCase()+'.*%20%20%20👉https://bit.ly/3zWYkwV'
let whatsapplinkEl=document.getElementById("whatsapplink")
whatsapplinkEl.href=`whatsapp://send?text=${sendmsg}`
